{"pageProps":{"frontmatter":{"title":"About Me","description":"About Me"},"page":{"content":"\nI'm a second-generation Korean-American that grew up in Mililani/Wahiawa, Hawaii. While serving 6 years in the United States Air Force, I graduated from [UMGC](https://www.umgc.edu/academic-programs/bachelors-degrees/software-development-and-security.cfm) with Bachelor's of Science in Software Development and (Application) Security; with a Minor in Cybersecurity. I spend most of my software development time doing research and building understanding, and then roll out my own implementations to stay updated with relevant technologies.\n\n## What I know now (after my military transition)\n\n**I have background in programming, but I'm not just a programmer:** It was a privilege to serve with my teams throughout my military career, by leading their efforts with regards to generating the most _business value_ appropriate to the circumstances. I've led tactical and operational arrangements which were crucial for the success of the mission, optimized costs that helped save each unit hundred-thousands of dollars, bridged people together to disagree and commit, and helped improve myself and peers through mutual mentorship. I did this all with just the expectation to demonstrate my core competencies in mechanical/electrical maintenance, but I wasn't just a maintainer.\n\n## What I do now\n\nI live in Seattle, Washington. I currently provide teaching assistance in a Computer Science courses (C# and HTML/CSS/JS) with [SMU](https://www.stmartin.edu/academics/programs-schools/hal-and-inge-marcus-school-engineering/areas-of-study/microsoft-software-and-systems-academy), and train as a SOC analyst every month with the Washington Air National Guard.\n\n## Why this website?\n\nI wanted learn how to build a website with [NextJS](https://nextjs.org/). It's [relevant](https://nextjs.org/showcase), and I needed a flexible yet simple SSG solution should my site scale later on; and dynamic routing with parsed Markdown pages is convenient.\n\nIt also serves as motivation for me to start writing about stuff I like (tech and non-tech), and to continue creating projects, because I finally put together a personal space to showcase it.\n\n## Contact\n\nYou can reach out to me at [alex.b.chong@outlook.com](mailto:alex.b.chong@outlook.com) if you want to connect. Thank you for your time.\n","excerpt":""}},"__N_SSG":true}