{"pageProps":{"frontmatter":{"title":"About Me","description":"About Me"},"page":{"content":"\nI'm a software engineer based in Seattle, WA. I grew up in Mililani/Wahiawa, Hawaii and spent the last five years overseas, serving with the United States Air Force (a story for another blog post 😎)\n\n## What's your background?\n\nI graduated from [UMGC](https://www.umgc.edu/academic-programs/bachelors-degrees/software-development-and-security.cfm) and studied Software Development and (Application) Security; with a Minor in Cybersecurity.\n\nIn the past, I've worked on anything from general-purpose applications (Java; C#), automated scripts (Python; Bash), to web interfaces (React; HTML/CSS/JavaScript)\n\nCurrently, I spend most of my software development time doing research and building understanding around web and scripting technologies, then roll out passion implementations for my own use cases.\n\n## What are you most enthusiastic for?\n\nI care about purpose-driven work, and have a concern for achieving the perfect combination of accesibility and security through user experience (UX) and developer experience (DX). My passion stack is continuously based on the needs to drive results for those concerns.\n\nTo me, this means delivering honest communication & maintaining trust, through both a functionally and visually-pleasing product -- all the while supporting the cause in some capacity to keeping information/data secure (Identity and Access Management comes to mind). The programming languages and tools come based on fulfilling those needs.\n\n## Why build this website?\n\nI wanted to learn how to build a website with [NextJS](https://nextjs.org/) because it's a [relevant](https://nextjs.org/showcase) (React) framework that will help me stay current with web development, and it provides the option of [hybrid rendering](https://nextjs.org/docs/advanced-features/automatic-static-optimization) should this site scale beyond just statically generated content.\n\nIt also serves as motivation for me to write about random stuff I like (tech and non-tech), and to showcase my projects. Find out more about my overall goal in my [first post](/post/telegraphing-competence).\n\n## Contact me\n\nYou can reach out to me at [alex.b.chong@outlook.com](mailto:alex.b.chong@outlook.com) if you want to connect. Cheers.\n","excerpt":""}},"__N_SSG":true}