{"pageProps":{"frontmatter":{"title":"Why You Should Use a Master Passphrase and Password Manager in 2021","description":"Avoid using one password for everything (like I did)","tags":["authentication","policy","security"],"date":"February 23, 2021"},"post":{"content":"\n## Table of Contents\n- [Table of Contents](#table-of-contents)\n- [Introduction](#introduction)\n- [Compromised Password Scenarios](#compromised-password-scenarios)\n- [Security vs Usability](#security-vs-usability)\n- [Solution](#solution)\n  - [Use a password manager](#use-a-password-manager)\n  - [Use a master passphrase (for your password manager)](#use-a-master-passphrase-for-your-password-manager)\n- [Conclusion](#conclusion)\n- [Footnotes](#footnotes)\n\n## Introduction\n\nA few years ago, both my primary email address and _only_ password at the time (used with >30 of my other online accounts) were stolen through the massive [MyFitnessPal data breach](https://content.myfitnesspal.com/security-information/FAQ.html).\n\nAccording to [NIST](https://pages.nist.gov/800-63-3/sp800-63b.html#5111-memorized-secret-authenticators) guidelines, my password was moderately strong in length. In addition, it was hashed with a `salt`<sup>[1](#1)</sup> using the industry-standard cryptographic hashing algorithm called [Bcrypt](https://cheatsheetseries.owasp.org/cheatsheets/Password_Storage_Cheat_Sheet.html#modern-algorithms). Theoretically, this password _should_ be impossible to crack, given the benefit best password security practices were followed. But it is always safe to assume the worst, or that they didn't.\n\nEven large OAuth or third-party sign-on providers like [Google](https://cloud.google.com/blog/products/g-suite/notifying-administrators-about-unhashed-password-storage) and [Facebook](https://about.fb.com/news/2019/03/keeping-passwords-secure/) have been honest with (and mitigated) storing their user passwords in `plain-text`. **Regarding risk management, mistakes or accidents do eventually happen even today.**\n\n## Compromised Password Scenarios\n\n1. A `plain-text password` is human-readable, and is presumed to be mapped with your email address in the breached database. In the events with Google and Facebook, they did not experience a known data breach here; they just internally caught and mitigated the issue.\n2. A `hashed password` may not have a random `salt` (or any `salt` at all), or not have a high default hashing `cost`<sup>[2](#2)</sup>. It is impossible to passively learn this information unless provided externally by the organization which in itself is a security risk for them.\n3. The database containing both the `salt` and `hash` (normally stored together within the same dataset) is compromised, despite using a hashing algorithm like Bcrypt. In this instance, [what most likely happened with MyFitnessPal](https://www.theregister.com/2019/02/11/620_million_hacked_accounts_dark_web/)\n\nIn the case of any organization -- there is only so much they can do to protect your login credentials (e.g. enforcing password policies, securing databases, secure connection) before that responsibility falls on the individual to follow their own best password practices.\n\n## Security vs Usability\n\nIt can be frustrating to be forced into abiding by minimum password requirements to use an app, service, or just get into your work account.\n\nVerifiers (e.g. an organization) prioritize security over usability through password policies to help influence more secure passwords, while subscribers (e.g. the users) prioritize usability over security to just speed run past the login screen.\n\nThe result of this abrasive arrangement between verifiers and subscribers can lead to these type of passwords:\n\n```\nPassword1!\n```\n\nOr the [Top 200 most common passwords in 2020](https://nordpass.com/most-common-passwords-list/), the top five passwords being:\n\n> 1. 123456\n> 2. 123456789\n> 3. picture1\n> 4. password\n> 5. 12345678\n\nAll of which, including some other variation of `Password1!` that uses a different word or phrase, would be cracked in a matter of seconds.\n\n## Solution\n\n### Use a password manager\n\nUsing a _dedicated_ password manager like [Bitwarden](https://bitwarden.com/) would help:\n- Store all your login credentials (much like how the saved login function works on your phone or browser)\n- Store encrypted secure notes on the cloud (e.g. using it as running CV to remember mailing addresses, or to track subscriptions you're signed up for)\n- Auto-fill login credentials across multiple desktop/mobile with Bitwarden installed\n- Generate a random secure password for each account you own, if you do decide to change a password on your next login for that account.\n\nAside from the listed benefits, the main purpose of having a password manager in the context of this write up is to **have an easy way of generating and accessing a burner password for each account to include:**\n- At least a minimum of 12 characters (you won't be memorizing these passwords, so go for more if you would like to)\n- Include all character sets provided in the password generation (e.g. A-Z, a-z, 0-9, special characters)\n- Include a number and special character minimum, and avoid ambiguous characters\n\n### Use a master passphrase (for your password manager)\n\n[Diceware](https://diceware.dmuth.org/) or the [Bitwarden Password Generator](https://bitwarden.com/password-generator/) (a feature built-in to the actual application) can generate a **passphrase** like this:\n\n```\nEaseful-Giving-Reseal-Fiddle\n```\n\nEntropy<sup>[3](#3)</sup> for the above passphrase is calculated to `184 bits` or `95^28` possible password combinations (basically it's uncrackable even beyond heat death of the universe).\n\nOne could even create their own **memorable passphrase** to include a number and special character:\n```\nPizza-Beer-Marvel-Avengers-$3.50\n```\n\nIn contrast to passphrases, this is a password that meets the minimum of at least:\n- 8 characters in length\n- An upper and lowercase character\n- A special character\n- No words or phrases\n\n```\ntqnRui5*\n```\nEntropy<sup>[3](#3)</sup> for this is `53 bits` or `95^8` possible password combinations. It's still a reasonably strong password, but can be theoretically cracked within a few hours. You can see an estimated calculation [here](https://www.security.org/how-secure-is-my-password/).\n\n## Conclusion\n**Avoid reusing a password**. Fulfilling password requirements such as minimum length and complexity takes unwanted time and effort away from your day. **Use a master passphrase with a password manager instead; have the best of both worlds in security and usability.**\n\n\n\n## Footnotes\n\n<sup id=\"2\">1</sup> [OWASP](https://cheatsheetseries.owasp.org/cheatsheets/Password_Storage_Cheat_Sheet.html#salting) defines **salt** as a unique, randomly generated string that is added to each password. [Dan Arias](https://auth0.com/blog/adding-salt-to-hashing-a-better-way-to-store-passwords/) of Auth0, and [Baeldung](https://www.baeldung.com/java-password-hashing), each wrote an in-depth yet approachable article about password hashing with a salt.\n\n<sup id=\"2\">2</sup> **Cost** is the measure to figure out the x amount of iterations, or rounds, that a hashing algorithms is invoked over a password string. The default cost for Bcrypt is `10` or `10^2 == 1024 rounds` of hashing.\n\n<sup id=\"2\">3</sup> **Entropy** is a measurement of how strong a password is; or how unpredictable it is to guess. The formula to calculate entropy bits is `log_2(S^L)`, where `S` is the size of a character set, and `L` is the password length. One example would be that a non-dictionary lowercase alphabet (a-z) password with 8 characters has an entropy of `log_2(26^8) == 38 bits` or up to `26^8 == 300 million` possible password combinations. Sounds like a lot (it is for desktop login), but consider that this password can be [theoretically be cracked in 50 minutes](https://security.stackexchange.com/a/182116)","excerpt":""},"previousPost":{"slug":"telegraphing-competence","frontmatter":{"title":"\"Telegraphing Competence\"","description":"Site introduction, and thoughts on moving forward with writing content","tags":["life","professional-development"],"date":"February 17, 2021"},"excerpt":"","content":"\nAfter spending much time and energy laying the groundwork, I'm excited to announce that I am finally able to launch this site for my blog and portfolio use.\n\n## Inspiration [#](#inspiration)\n\nMy overall goal with this website (to add onto my [what I wrote on the About page](/about#why-this-website)) is to help further demonstrate my technical and communicative competence through writing.\n\nIt was an initial excuse (and half-joke) for me that because [all early-career development portfolios look the same](https://hecklerjim.github.io/generated-portfolio/), that I should deviate from creating my own quirky portfolio site that bears semblance to online macaroni art; and to focus more time grinding out Leetcode problems for interview prep. But my stance has changed on that since.\n\n[Josh Thompson](https://josh.works/remote-job-resources#telegraphing-competence), a software developer known for his high-profile advices shared around Hacker News, asserts his thoughts on writing for early-career seekers in one of his earlier humble articles in 2019:\n\n> None of \\[my\\] posts are earth shattering (actually, they are _all_ very basic) but it telegraphs:\n>\n> - I have some initiative. Not necessarily a lot, but at least a little\n> - I can write words in a legible and readable fashion. This is valuable in a remote work environment, as almost all communication will be written. (I.E. writing skills are particularly valuable.)\n\nSome of the posts I've seen that he claims as basic are actual well-written observations around technologies he's new to using. He even writes about stuff like his time [cooking in 36 different kitchens in a year](https://josh.works/what-ive-learned-from-cooking-in-36-kitchens-in-the-last-year).\n\nOverall, seems like a neat way to express my personality both formally and informally; beyond the elevator pitch.\n\n## Next Steps [#](#next-steps)\n\n**I want to use this opportunity to produce content that is helpful and relevant to those that might read it.** Ideally, it would be around software/web development and cybersecurity; to include any research findings, guides & tutorials, or any other write-ups I believe would add value to the discussion. Also, I'd also like to write about non-technology stuff too (like a review for a weightlifting program, or some useful lifehacks).\n"},"nextPost":null},"__N_SSG":true}